InformationRegisters/СтепеньГотовностиСообщенийИнтегрированныхСистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>СтепеньГотовностиСообщенийИнтегрированныхСистем</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПроцентГотовности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СообщенияИнтегрированныхСистем</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СтепеньГотовностиСообщенийИнтегрированныхСистем/Ext/ManagerModule.bsl
// Устанавливает степень готовности сообщения интегрированных систем
Процедура УстановитьПроцентГотовности(Сообщение, Процент) Экспорт
	
	МенеджерЗаписиГотовности = РегистрыСведений.СтепеньГотовностиСообщенийИнтегрированныхСистем.СоздатьМенеджерЗаписи();
	МенеджерЗаписиГотовности.Сообщение = Сообщение;
	МенеджерЗаписиГотовности.ПроцентГотовности = Процент;
	МенеджерЗаписиГотовности.Записать();
	
КонецПроцедуры

Функция ПолучитьПроцентГотовностиСообщения(Сообщение) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтепеньГотовностиСообщенийИнтегрированныхСистем.ПроцентГотовности
		|ИЗ
		|	РегистрСведений.СтепеньГотовностиСообщенийИнтегрированныхСистем КАК СтепеньГотовностиСообщенийИнтегрированныхСистем
		|ГДЕ
		|	СтепеньГотовностиСообщенийИнтегрированныхСистем.Сообщение = &Сообщение";
	Запрос.УстановитьПараметр("Сообщение", Сообщение);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ПроцентГотовности;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции
